Hello,

thank you for the implementation. I created a new robot with full permission on system and project level and tested it with Terraform. It get much less errors like before, but I still get some errors. Is that expected?

I tested it with the following Versions:
- Harbor Server: Version v2.10.0-6abb4eab
- Terraform version: Terraform v1.5.7
- Harbor Terraform Provider: 3.10.5

```hcl
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.projects.harbor_robot_account.robot_account["robot-test"] will be created
  + resource "harbor_robot_account" "robot_account" {
      + disable   = false
      + duration  = -1
      + full_name = (known after apply)
      + id        = (known after apply)
      + level     = "system"
      + name      = "test"
      + robot_id  = (known after apply)
      + secret    = (sensitive value)

      + permissions {
          + kind      = "project"
          + namespace = "test"

          + access {
              + action   = "create"
              + effect   = "allow"
              + resource = "artifact-label"
            }
          + access {
              + action   = "create"
              + effect   = "allow"
              + resource = "tag"
            }
          + access {
              + action   = "list"
              + effect   = "allow"
              + resource = "artifact"
            }
          + access {
              + action   = "list"
              + effect   = "allow"
              + resource = "repository"
            }
          + access {
              + action   = "list"
              + effect   = "allow"
              + resource = "tag"
            }
          + access {
              + action   = "pull"
              + effect   = "allow"
              + resource = "repository"
            }
          + access {
              + action   = "push"
              + effect   = "allow"
              + resource = "repository"
            }
          + access {
              + action   = "read"
              + effect   = "allow"
              + resource = "artifact"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ robot_secrets = (sensitive value)
╷
│ Error: unexpected end of JSON input
│
│   with harbor_config_auth.oidc,
│   on oidc.tf line 1, in resource "harbor_config_auth" "oidc":
│    1: resource "harbor_config_auth" "oidc" {
│
╵
╷
│ Error: Error getting system configuration unexpected end of JSON input
│
│   with harbor_config_system.config_system,
│   on system-configuration.tf line 1, in resource "harbor_config_system" "config_system":
│    1: resource "harbor_config_system" "config_system" {
│
╵
gmake: *** [Makefile:19: plan] Error 1
```

The test robot account from the code above is already created before with Terraform. It seems for me that the full permission robot-account can´t still manage the harbor_config_system, harbor_config_auth and robot-account resources.